org/02data_abstractions.org
#+TITLE: Chapter 2: Building Abstractions with Data
#+AUTHOR: Caesar X Insanium

Relevant lectures
- [[https://www.youtube.com/watch?v=DrFkf-T-6Co&t=3722s][Lecture 2B]]
- [[https://www.youtube.com/watch?v=PEwZL3H2oKg&list=PLE18841CABEA24090&index=5][Lecture 3A]]

* 2.1 Introduction of Data Abstraction

Chapter one focused on using elementary data and procedures to construct
higher order functions and can be used to express some higher level
algorithms and processes using simple functions.

However, everything that has been learned use only integers, float and
ratios. Even more complex behavior require the use to computational
objects that have different parts. =Compound Data= is the building of
abstraction by combining data objects. Compound procedures allow for
elevated procedures and is the same with compound data.

A simple example is in designing a system that allows for addition of
rational numbers by acting on compound data that have a component of
denominator and numerator. Designing procedures that kept track of
individual primitive data would be a hassle to maintain, so components
must be glued together in order to be managed.

Compound data also allow for separation of the actions and procedures
that act on the data from the actual implementation and background of
the compound data. =Data Abstraction= is the idea that the true nature
of how data ideas are represented in the hardware is hidden from user in
order for easier design and management.

Linear Combinations can be expressed as such.

#+begin_src scheme
(define (linear-combination a b x y)
  (+ (* a x) (* b y)))
#+end_src

This implementation take is 4 numbers, However, we can define using data
abstraction a procedure that takes 4 anything and performs the
appropriate procedures defined for the data object on the data provided.
The add and mul procedures determine the data type in question and use
correct procedure for addition and multiplication respectably

#+begin_src scheme
(define (linear-combination a b x y)
  (add (mul a x) (mul b y)))
#+end_src

Abstraction is a technique that can be used to manage complexity and
this chapter will focus on the use of data abstraction in order to
separate different sections for program.

Programming languages provide the glue for allowing this forms of
abstractions. From the way that data is stored and represented in
computer to expression data as nothing more than procedures on primitive
data. =Closure= is the idea that a language allows for the combining of
both primitive data and compound data. =Symbolic= expression is
augmentation of language expressive power by arbitrary symbols as
opposed to numbers in which they are not defined and called until they
are used store some data.

=Generic Operations= allow for defining generic operations that can be
applied to different data types and a =data oriented programming=
approach. This in technique, data is the most important concept and data
representations are defined separately and combined =additively=


* 2.2 Hierarchical Data and Closure Property
:PROPERTIES:
:CUSTOM_ID: hierarchical-data-and-closure-property
:END:

#+begin_quote
Relevant Lecture section start at 3A 8:00, current time 28:38
#+end_quote

We have learned that the =cons= function can be used to build simple
data representations and abstractions of which individual parts can be
accessed with =car= and =cdr=. Numbers and other pairs can be combined
in this method.

The closure property of cons refers to its ability to represent abstract
data and concepts. In accordance to specification. Hierarchical
structures are made up of smaller parts coming together in order to make
bigger parts.

** 2.2.1 Representing Sequences
:PROPERTIES:
:CUSTOM_ID: representing-sequences
:END:
The logical extension is that =cons= can be used to build arbitrary long
sequences of which, lists can be built. A collection of different items
that end in a nil item.

#+begin_src scheme
(define l (cons 1 (cons 2 (cons 3 (cons 3 nil)))))
#+end_src

Scheme defines this as a =list= can can be defined with a function and a
series of arguments. Merely syntactic sugar for the above code segment.

#+begin_src scheme
(define 1-to-4 (list 1 2 3 4))
#+end_src

Individual elements can be accessed individually by using =car= and
=cdr=.

#+begin_src scheme
(car (cdr (cdr 1-to-4)))
;; => 3
#+end_src

Certain list operations have been defined by Scheme such as =list-ref=
which inputs a list and an index.

#+begin_src scheme
(define (list-ref items n)
  (if (= n 0)
      (car items)
      (list-ref (cdr items) (- n 1))))
#+end_src

Finding the length of a list is easy as well since we only need to
recurse down a list until we find a null element, all the while adding
one to a counter every time we recurse.

#+begin_src scheme
(define (length items)
  (if (null? items)
      0
      (+ 1 (length (cdr items)))))

(define (length-iter items)
  (define (iter a count)
    (if (null? a)
        count
        (iter (cdr a) (+ 1 count))))
  (iter items 0))
#+end_src

It is also possible to define another procedure that takes in a list and
generates a new list with a new element added.

#+begin_src scheme
(define (append list1 list2)
  (if (null? list1)
      list2
      (cons (car list1) (append (cdr list1) list2))))
#+end_src

*** Mapping Over Lists

One useful function is to take a list and apply a transformation on each
item and generate a new list. The scheme =map= function is for this
purpose. This is a higher order procedure.

#+begin_src scheme
(define nil '())
(define (map proc items)
  (if (null? items)
      nil
      (cons (proc (car items))
            (map proc (cdr items)))))

;; Scheme Standard defines a map function that takes in a procedure of n parameters
;; and with n lists of same length
(map (lambda (x y z)
       (+ x y z))
     (list 1 2 3)
     (list 4 5 6)
     (list 7 8 9))
#+end_src

Other functions can then be defined in terms of this map function. This function
would take a list of numbers and return a new list with all the numbers multiplied
against another value.


#+begin_src scheme
(define (scale-list items factor)
  (map (lambda (x) (* factor x)) items))
#+end_src

The key concept here are the layers of abstraction that hides away the
complexities in order to allow programmer to work on their program
instead of their implementation.

Abstraction allows for using a high level concept without regards to
implementation and allows and a change in implementation should not
result in change in behavior for the use to deal with.

** 2.2.2 Hierarchical Structures

The =cons= function allows for the holding of more than just numbers,
other cons boxes can hold more cons boxes. This allows for a rudimentary
tree to be defined and used. Cons boxes can hold indefinite levels of
cons boxes. Restricted only by the amount of memory a computer holds.

#+begin_src scheme
(cons (cons 1 2)
      (cons 3 4))
#+end_src

Tree structures lend themselves easily to recursion since operations on
entire trees can be simplified to operations on branches and then to
leaves. Deciding weather or not an object is a pair can be made easy
with the scheme function =pair?=

#+begin_src scheme
(pair? (cons 1 2)) ; => #t
#+end_src

A simple procedure for recursively counting the number of leaves on a
tree is shown.

#+begin_src scheme
(define (count-leaves x)
  (cond ((null? x) o)
        ((not (pair? x)) 1)
        (else (+ (count-leaves (car x))
                 (count-leaves (cdr x))))))
#+end_src

