org/02data_abstractions.tex
\item Mapping Over Trees
\label{sec:orgb29765a}
The \texttt{map} procedure is a powerful concept that can be used in order to
define a way to create a new list using the elements of an existing list
and applying a procedure to build it. A procedure to apply the same idea
to trees should not be difficult to imagine.

\begin{verbatim}
;; Here is test procedure to apply an operation accrross every object in a tree
(define (scale-tree tree factor)
  (cond ((null? tree) nil)
        ((not (pair? tree)) (* tree factor))
        (else (cons (scale-tree (car tree) factor)
                    (scale-tree (cdr tree) factor)))))
\end{verbatim}

Then we can build a procedure that abstract away from of the details and
leaves a simple interface.

\begin{verbatim}
(define (tree-map proc tree)
  (cond ((null? tree) nil)
        ((not (pair? tree)) (proc tree))
        (else (cons (tree-map proc (car tree))
                    (tree-map proc (cdr tree))))))
\end{verbatim}
\end{enumerate}

\subsubsection{2.2.3 Sequences as Conditional Interfaces}
\label{sec:org5ddfc65}
Conventional Interfaces are used in order to design data in a way to
solve a particular problem without regards to underlying
implementations. This allows for internal representation to change and
as long as behavior does not change this allows for user to continue
using the data with no worry.

For example given the two programs.

\begin{verbatim}
(define (even-fibs n)
  (define (next k)
    (if (> k n)
        nil
        (let ((f (fib k)))
          (if (even? f)
              (cons f (next (+ k 1)))
              (next (+ k 1))))))
  (next 0))

(define (sum-odd-squares tree)
  (cond ((null? tree) 0)
        ((not (pair? tree)) (if (odd? tree) (square tree) 0))
        (else (+ (sum-odd-squares (car tree))
                 (sum-odd-squares (cdr tree))))))
\end{verbatim}

These follow a similar pattern in that follow similar steps

\begin{itemize}
\item travel through the different leaves
\item selects them based on criteria
\item accumulates the results
\end{itemize}

In there are steps of enumeration, mapping and accumulation. However,
the different is the order in which steps are done.

\begin{enumerate}
\item Sequence Operations
\label{sec:org01dc09a}
One way to think about this is laid out big the book in which each
number or leave that is traversed is a signal, and they must be
processed, filtered and measured in order to be useful.

Defining signals as simply lists allow us to simply \texttt{map} over them in
order to process them.

\begin{verbatim}
(map square (list 1 2 3 4 5))
\end{verbatim}

Filtering can be easily implemented for lists.

\begin{verbatim}
(define nums (list 1 2 3 4 5 6))

(define (filter predicate sequence)
  (cond ((null? sequence) nil)
        ((predicate (car sequence))
         (cons (car sequence)
               (filter predicate (cdr sequence))))
        (else (filter predicate (cdr sequence)))))

;; usage like so
(filter odd? nums) ;; => (1 3 5)
\end{verbatim}

Accumulation

\begin{verbatim}
(define (accumulate op initial sequence)
  (if (null? sequence)
      initial
      (op (car sequence)
          (accumulate op initial (cdr sequence)))))

(accumulate + 0 nums);; => 21
\end{verbatim}

Final thing need for implementation of signal processing is the
enumeration for numbers and trees.

\begin{verbatim}
(define (enumurate-interval low high)
  (if (> low high)
    nil
    (cons low (enumurate-interval (+ low 1) high))))

(define (enumurate-tree tree)
  (cond ((null? tree) nil)
        ((not (pair? tree)) (list tree))
        (else (append (enumurate-tree (car tree))
                      (enumurate-tree (cdr tree))))))
\end{verbatim}

The same procedures can now be implemented in terms of these functions.
One may notice that each procedure is a sequence of operations.
Designing programs in a modular and sequential way allows for easy
modularity in by allowing a library of components that can then be
stringed together in order to solve a problem.

\begin{verbatim}
;; Gives of the squares of fibanacchi numbers
(define (list-of-fib-square n)
  (accumulate cons nil (map square
                            (map fib (enumurate-interval 0 n)))))

;; Squares the odd elements and multiplies them together
(define (product-of-squares-of-odd-elements sequence)
  (accumulate * 1 (map square
                       (filter odd? sequence))))

;; Example on how joining these operations can be used in order to solve real
;; world problems. This reminds me of SQL selector operations
(define (salary-of-higher-paid-programmer records)
  (accumulate max 0 (map salary
                         (filter programmer? record))))
\end{verbatim}

Moral of the story here, if one sees a low of repeating code the goal is
to abstract what is possible into a modular procedure that can be called
with arguments being the differentiation part of the thing.

\item Nested Mappings
\label{sec:orgc1508d9}
It is possible to use the mapping and accumulated procedures in order to
device a way of implementing nested for loops. For each value of \emph{i} and
then for each value of \emph{j}. The method for applying this is to generate
a list of the relevant indexes, then mapping over and filtering relevant
values and finally generate a sequence of the answers that we are
looking for.

In the example problem, we are trying to find all the unique pairs of
\emph{i} and \emph{j} such that their sum is a prime number.

\begin{verbatim}
;; Generate pairs of indices
(define (gen-pairs n)
  (accumulate append
              nil
              (map (lambda (i)
                     (map (lambda (j)
                            (list i j))
                          (enumurate-interval 1 (- i 1))))
                   (enumurate-interval 1 n))))

(define (flatmap proc seq)
  (accumulate append nil (map proc seq)))

;; Filter Function
(define (prime-sum? pair)
  (prime? (+ (car pair) (cadr pair))))

;; Generate list with pairs and their sum
(define (make-pair-sum pair)
  (list (car pair) (cadr pair) (+ (car pair) (cadr pair))))

;; Final Generate the actual list, final answer
(define (prime-sum-pairs n)
  (map make-pair-sum (filter prime-sum?
                             (flatmap (lambda (i)
                                        (map (lambda (j) (list i j))
                                             (enumurate-interval 1 (- i 1))))
                                      (enumurate-interval 1 n)))))
\end{verbatim}

Using nested mapping allow for easy generation of permutations and
combinations. Generating permutations can be achieved with this simple
procedure.

\begin{verbatim}
(define (remove item sequence)
  (filter (lambda (x) (not (= x item))) sequence))

(define (permutations s)
  (if (null? s)
      (list nil)
      (flatmap (lambda (x)
                 (map (lambda (p)
                        (cons x p))
                      (permutations (remove x s))))
               s)))

(permutations (list 1 2 3))
\end{verbatim}

This allows use to more easily work with nested mappings so that the
code the deals with the nested mapping is separate from the code the
deals with generating the nested data structures that the nested maps
work with.
