org/02data_abstractions.org
**** 2.2.4 Example: A Picture Language
:PROPERTIES:
:CUSTOM_ID: example-a-picture-language
:END:
We are introduced to a hypothetical picture language that makes use of
the concept of a painter. If a painter is given a rectangle, it will
attempt to draw an image on it given a set definitions of a rectangle
and treats it as a canvas. Painters can be stacked on top of each other
in a form of closure. It can use the lisp programming language in order
to satisfy this closure property.

The closure property refers to ability of express the idea that complex
things can be built using simple things. It is possible to generate very
complex patterns by the different procedures that act on the painter.

Higher order operations can be achieved with procedure generators. The
power lies in lisp's ability to create entirely new languages.

I am able to use the picture language and test it out using DrRacket and
the SCIP package.

The lecture talks about the closure property. From I can follow I only
need to implement some very basic primitives in order to implement the
full stack of the picture language.

Frames are a definition of rectangles/canvas that are painter. A painter
is an object that when painted draws a picture.

#+begin_src scheme
;; Allows for creation of a new procedure that represents a linear transformation
(define (frame-coord-map frame)
  (lambda (v)
    (add-vec (origin-frame frame)
             (add-vec (scale-vec (vecx v)
                                 (edge1-frame frame))
                      (scale-vec (vecy v)
                                 (edge2-frame frame))))))

;; takes list of segments and create a painter that draws line in those represented segments
(define (segments->painter segment-list)
  (lambda (frame)
    (for-each (lambda (segment)
                (draw-line ((frame-coord-map frame) (start-segment segment))
                           ((frame-coord-map frame) (end-segment segment))))
              segment-list)))
#+end_src

Using these functions it is possible to define new ways of creating
painter objects in terms of other painter objects.

#+begin_src scheme

;; This will create a new painter that will flip the image upside down
(define (flip-vert painter)
  (transform-painter painter
                     (make-vect 0.0 1.0)
                     (make-vect 1.0 1.0)
                     (make-vect 0.0 0.0)))

;; self explanatory
(define (shrink-to-upper-right painter)
  (transform-painter painter
                     (make-vect 0.5 0.5)
                     (make-vect 1.0 0.5)
                     (make-vect 0.5 1.0)))

(define (rotate90 painter)
  (transform-painter painter
                     (make-vect 1.0 0.0)
                     (make-vect 1.0 1.0)
                     (make-vect 0.0 0.0)))

(define (squash-invards painter)
  (transform-painter painter
                     (make-vect 0.0 0.0)
                     (make-vect 0.65 0.35)
                     (make-vect 0.35 0.65)))
#+end_src

And now the all important beside function.

#+begin_src scheme
(define (beside painter1 painter2)
  (let ((split-point (make-vect 0.5 0.0)))
    (let ((paint-left (transform-painter painter1
                                         (make-vect 0.0 0.0)
                                         split-point
                                         (make-vect 0.0 1.0)))
          (paint-right (transform-painter painter2
                                          split-point
                                          (make-vect 1.0 0.0)
                                          (make-vect 0.5 1.0))))
      (lambda (frame)
        (paint-left frame)
        (paint-right frame)))))
#+end_src

All of this satisfies the closure property. The closure property seems
to be an ability for lower level primitives

This idea of closure property allows for a =stratified= design in which
one level solely depends on the lower levels. All computer science is
based off of layers of abstraction. Lisp allows for language levels to
be designed and use based one simple primitives the are provides on
lower levels.

In theory a change in design or implementation should not have a
significant effect on the upper layers of the language. There are many
examples of this, but the picture language is the example given by the
book.

Also the last exercise is skipped.

* 2.3 Symbolic Data
:PROPERTIES:
:CUSTOM_ID: symbolic-data
:END:

Scheme allows for the use of arbitrary symbols in as a means to work with
data.

*** 2.3.1 Quotation

Allows for expressing literal symbols inside of a an expression and not
the values the the symbols themselves are supposed to represent. This can
be accomplished with the quotation operator.

#+begin_src scheme
(define symbol 'define)
(define list-of-symbols '(a b c d))
;; quote function is possible. This allows for a keeping of standards
(define symbol2 (quote 'display))
(define other-list-of-symbols (quote (1 2 3 4)))
#+end_src

Allows for a differentiation between expressions to be evaluated and data
representation that can be manipulated and explored. The =eq?= function
allows for testing for the equality of symbols.

#+begin_src scheme
(define s 'a)
(eq? 'a s)
#+end_src

#+RESULTS:
: #t

An implementation of =memq= is possible which checks a list for the presence
of a specific symbol inside of it. If it is not contained then the function
returns false. If it is contained then the function returns a sublist
which the item as first entry.

#+begin_src scheme
(define (memq item x)
  (cond ((null? x) #f)
        ((eq? item (car x) )x)
        (else (memq item (cdr x)))))

(memq 'a (list  '0 'banana 'a 'b 'c))
#+end_src

*** 2.3.2 Example: Symbolic Differentiation

Note: I am assuming that I already did the exercises.
