org/02data_abstractions.tex

\item 2.2.4 Example: A Picture Language
\label{sec:org7b37cbd}
We are introduced to a hypothetical picture language that makes use of
the concept of a painter. If a painter is given a rectangle, it will
attempt to draw an image on it given a set definitions of a rectangle
and treats it as a canvas. Painters can be stacked on top of each other
in a form of closure. It can use the lisp programming language in order
to satisfy this closure property.

The closure property refers to ability of express the idea that complex
things can be built using simple things. It is possible to generate very
complex patterns by the different procedures that act on the painter.

Higher order operations can be achieved with procedure generators. The
power lies in lisp's ability to create entirely new languages.

I am able to use the picture language and test it out using DrRacket and
the SCIP package.

The lecture talks about the closure property. From I can follow I only
need to implement some very basic primitives in order to implement the
full stack of the picture language.

Frames are a definition of rectangles/canvas that are painter. A painter
is an object that when painted draws a picture.

\begin{verbatim}
;; Allows for creation of a new procedure that represents a linear transformation
(define (frame-coord-map frame)
  (lambda (v)
    (add-vec (origin-frame frame)
             (add-vec (scale-vec (vecx v)
                                 (edge1-frame frame))
                      (scale-vec (vecy v)
                                 (edge2-frame frame))))))

;; takes list of segments and create a painter that draws line in those represented segments
(define (segments->painter segment-list)
  (lambda (frame)
    (for-each (lambda (segment)
                (draw-line ((frame-coord-map frame) (start-segment segment))
                           ((frame-coord-map frame) (end-segment segment))))
              segment-list)))
\end{verbatim}

Using these functions it is possible to define new ways of creating
painter objects in terms of other painter objects.

\begin{verbatim}

;; This will create a new painter that will flip the image upside down
(define (flip-vert painter)
  (transform-painter painter
                     (make-vect 0.0 1.0)
                     (make-vect 1.0 1.0)
                     (make-vect 0.0 0.0)))

;; self explanatory
(define (shrink-to-upper-right painter)
  (transform-painter painter
                     (make-vect 0.5 0.5)
                     (make-vect 1.0 0.5)
                     (make-vect 0.5 1.0)))

(define (rotate90 painter)
  (transform-painter painter
                     (make-vect 1.0 0.0)
                     (make-vect 1.0 1.0)
                     (make-vect 0.0 0.0)))

(define (squash-invards painter)
  (transform-painter painter
                     (make-vect 0.0 0.0)
                     (make-vect 0.65 0.35)
                     (make-vect 0.35 0.65)))
\end{verbatim}

And now the all important beside function.

\begin{verbatim}
(define (beside painter1 painter2)
  (let ((split-point (make-vect 0.5 0.0)))
    (let ((paint-left (transform-painter painter1
                                         (make-vect 0.0 0.0)
                                         split-point
                                         (make-vect 0.0 1.0)))
          (paint-right (transform-painter painter2
                                          split-point
                                          (make-vect 1.0 0.0)
                                          (make-vect 0.5 1.0))))
      (lambda (frame)
        (paint-left frame)
        (paint-right frame)))))
\end{verbatim}

All of this satisfies the closure property. The closure property seems
to be an ability for lower level primitives

This idea of closure property allows for a \texttt{stratified} design in which
one level solely depends on the lower levels. All computer science is
based off of layers of abstraction. Lisp allows for language levels to
be designed and use based one simple primitives the are provides on
lower levels.

In theory a change in design or implementation should not have a
significant effect on the upper layers of the language. There are many
examples of this, but the picture language is the example given by the
book.

Also the last exercise is skipped.
\end{enumerate}

\section{2.3 Symbolic Data}
\label{sec:org474e67f}
\end{document}